app/controllers/events_controller.rb

INSERT INTO `events` (`title`, `location`, `evtdate`, `comment`, `user_id`, `created_at`, `updated_at`) VALUES ('test2', 'trios', '2018-03-30', 'sgfd ghfsd', 2, '2018-03-28 23:20:41', '2018-03-28 23:20:41')
---
  def create



  eve = Event.new (params.require(:event).permit(:title, :location,:evtdate,:comment,:user_id))

    eve.save