app/controllers/posts_controller.rb

INSERT INTO `posts` (`attachment`, `content`, `user_id`, `created_at`, `updated_at`) VALUES ('gsug gydua', 'adasd sfdfs', 2, '2018-03-27 23:29:58', '2018-03-27 23:29:58')
---
  def create
   # @post = Post.new(post_params)

  #  respond_to do |format|
   #   if @post.save
    #    format.html { redirect_to @post, notice: 'Post was successfully created.' }
     #   format.json { render :show, status: :created, location: @post }
      #else
       # format.html { render :new }
        #format.json { render json: @post.errors, status: :unprocessable_entity }
      #end
    #end
   @post = Post.new(post_params) do |post|
     post.user = current_user
   end
   if @post.save